Catalogs/НастройкиПодключениеРРО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключениеРРО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРРО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТестовыйФН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКЧекамФайл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайлаЧеков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Операторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оператор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиПодключениеРРО/Ext/ManagerModule.bsl
Функция ПолучитьСтруктуруПодключенияРРО(ВидРРО, КассаККМ) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПодключениеРРО.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА НастройкиПодключениеРРО.ИспользоватьТестовыйФН
		|			ТОГДА ""7000000512""
		|		ИНАЧЕ НастройкиПодключениеРРО.Ссылка.ФискальныйНомер
		|	КОНЕЦ КАК ФН,
		|	НастройкиПодключениеРРО.ИспользоватьТестовыйФН,
		|	НастройкиПодключениеРРО.Организация,
		|	НастройкиПодключениеРРО.Склад,
		|	НастройкиПодключениеРРО.ОтправлятьСообщение,
		|	НастройкиПодключениеРРО.БезНДС,
		|	НастройкиПодключениеРРО.ПутьКЧекамФайл,
		|	НастройкиПодключениеРРО.РасширениеФайлаЧеков
		|ИЗ
		|	Справочник.НастройкиПодключениеРРО КАК НастройкиПодключениеРРО
		|ГДЕ
		|	НЕ НастройкиПодключениеРРО.ПометкаУдаления
		|	И НастройкиПодключениеРРО.ВидРРО = &ВидРРО
		|	И НастройкиПодключениеРРО.КассаККМ = &КассаККМ";
	
	Запрос.УстановитьПараметр("ВидРРО", ВидРРО);
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	МассВидовОплат 			= Новый Массив;
	СтрВидОплаты 			= Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПараметров.Вставить("ФН", ВыборкаДетальныеЗаписи.ФН);
		
		ВидыОплат = ВыборкаДетальныеЗаписи.Ссылка.ВидОплаты;
		Если ВидыОплат.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Не заполнен вид оплат");	
		КонецЕсли;
		
		Для Каждого ВидОплаты из ВидыОплат Цикл
			СтрВидОплаты.Вставить("ВидОплаты", ВидОплаты.ID);
			СтрВидОплаты.Вставить("ФормаОплаты", ВидОплаты.ФормаОплаты);
			МассВидовОплат.Добавить(СтрВидОплаты);
		КонецЦикла;	
		
		Операторы = ВыборкаДетальныеЗаписи.Ссылка.Операторы;
		Если Операторы.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Не заполнен оператор");	
		КонецЕсли;
		
		Для Каждого Оператор ИЗ Операторы Цикл
			Если ВыборкаДетальныеЗаписи.Ссылка.ИспользоватьТестовыйФН Тогда
				СтруктураПараметров.Вставить("Оператор","1111111111"); 
			Иначе
				СтруктураПараметров.Вставить("Оператор", Оператор.ID); 
			КонецЕсли;
		КонецЦикла;
		
		СтруктураПараметров.Вставить("ОтправлятьСообщение", ВыборкаДетальныеЗаписи.ОтправлятьСообщение); 
		СтруктураПараметров.Вставить("ТаблицаОплат", МассВидовОплат);
		СтруктураПараметров.Вставить("Организация", ВыборкаДетальныеЗаписи.Организация);
		СтруктураПараметров.Вставить("Склад", ВыборкаДетальныеЗаписи.Склад);
		СтруктураПараметров.Вставить("БезНДС", ВыборкаДетальныеЗаписи.БезНДС);
		СтруктураПараметров.Вставить("ПутьКЧекамФайл", ВыборкаДетальныеЗаписи.ПутьКЧекамФайл);
		СтруктураПараметров.Вставить("РасширениеФайлаЧеков", ВыборкаДетальныеЗаписи.РасширениеФайлаЧеков);
	КонецЦикла;
	
	Возврат СтруктураПараметров;
	
КонецФункции
